{
  "backend/main.mo": "Motoko actor defining the app store backend with types for apps, reviews, and categories, providing functions to add apps, search/filter apps by name/developer/category, retrieve apps, and submit reviews with automatic rating calculation.",
  "feature_evidence.json": "Feature evidence report documenting five implemented features (home page, search interface, category browsing, app detail pages, and review submission) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing their purpose and functionality, covering pages, components, hooks, and styling configuration.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark mode color schemes using OKLCH color space with neutral grays and brand colors for UI components.",
  "frontend/index.html": "HTML entry point for the Champ Playstore application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for home, category, and app detail pages, wrapped in a layout with navbar, footer, and toast notifications.",
  "frontend/src/components/AppCard.tsx": "Reusable card component displaying app icon, name, developer, and star rating with hover effects and navigation to the app detail page.",
  "frontend/src/components/CategorySection.tsx": "Section component rendering a horizontally scrollable list of up to 10 apps for a given category with category icon, title, and \"See all\" link.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright notice and attribution link to caffeine.ai with UTM tracking parameters based on hostname.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation header with logo, search bar, category links for desktop, and responsive mobile menu using sheet drawer component.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting app reviews with star rating input, comment textarea, and validation. Uses mutation hook to submit reviews and displays toast notifications for success/error states.",
  "frontend/src/components/ReviewsList.tsx": "Displays a list of reviews in card format showing star rating, reviewer principal (truncated), timestamp, and optional comment. Shows empty state message when no reviews exist.",
  "frontend/src/components/ScreenshotsGallery.tsx": "Carousel component for displaying app screenshots with click-to-expand dialog functionality. Uses shadcn carousel and dialog components with responsive grid layout.",
  "frontend/src/components/SearchBar.tsx": "Search input with debounced queries for app name and developer search. Displays combined, deduplicated results in a dropdown with app icons, ratings, and categories.",
  "frontend/src/components/StarRating.tsx": "Read-only star rating display component supporting full, half, and empty stars with configurable sizes (sm/md/lg). Renders 5 stars based on numeric rating value.",
  "frontend/src/components/StarRatingInput.tsx": "Interactive star rating input with hover preview and click-to-select functionality. Allows users to select ratings from 1-5 stars with visual feedback.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state. Automatically invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status. Handles AuthClient creation with configurable options and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching apps (all, by category, by ID) and searching (by name/developer). Includes mutation hook for adding reviews with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a vibrant app store color palette using OKLCH color space. Includes light/dark mode themes and brand color utility classes.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AppDetailPage.tsx": "Displays detailed information for a single app including icon, name, developer, rating, screenshots gallery, description, reviews list, and a review submission form. Handles loading states with skeletons and shows error state if app is not found.",
  "frontend/src/pages/CategoryPage.tsx": "Shows all apps within a selected category in a grid layout with sorting options (popularity, rating, name). Includes loading skeletons and empty state handling.",
  "frontend/src/pages/HomePage.tsx": "Main landing page featuring a hero banner, featured apps section, popular apps sorted by downloads, and category sections for browsing. Displays loading skeletons while data is fetching.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, brand colors, container settings, border radius variables, animations, and plugins for typography and container queries.",
  "project_state.json": "Project metadata describing Champ Playstore as an app store application with features for browsing, searching, and discovering apps. Includes architectural notes, image requirements, and completed feature list."
}